1s/ERP/Conf/Documents/Лико_ОтчетФормногоУчастка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ОтчетФормногоУчастка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_ЗатратыПоЗаказуДляОтгрузки</xr:Item>
				<xr:Item>AccumulationRegister.Лико_ЗатратыПоЗаказу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыДокументовОтчетФормногоУчастка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстаткиПоЗатратам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзготовлениеФорм</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБланка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидФормы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидыФорм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПолимера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидыПолимеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНовых</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПеределок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаПеределки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ПричиныПеределкиФорм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПроката</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗасветкаStork</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБланка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСетки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Диаметр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Монтаж</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Паста</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НанесениеЭмульсии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Засветка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сварка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СнятиеДляПовторногоНанесения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МонтажБУСетки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Печатник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Stork</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сдана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПроката</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТрафСетки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБланка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыхСеток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтарыхСеток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСетки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидыСеток</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПроката</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Засветка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Паста</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НанесениеЭмульсии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смывка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыДокументовОтчетФормногоУчастка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыДокументовОтчетФормногоУчастка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Формы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗасветкиStork</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрафаретныеСетки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыПечати</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Флексо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Офсет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Глубокая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бессольвент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Траф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Цифровая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ОтчетФормногоУчастка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипДокумента) Тогда
		Объект.ТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.Формы;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ТабельныйНомер = Число(Прав(Объект.Сотрудник.Код, 10));
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	ПредыдущийТипДокумента = Объект.ТипДокумента;
	
	УстановитьВидимостьДоступностьЭлементов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	Элементы.ИзготовлениеФорм.Видимость = Объект.ТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.Формы;
	Элементы.ЗасветкаStork.Видимость = Объект.ТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.ЗасветкиStork;
	Элементы.ТрафСетки.Видимость = Объект.ТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.ТрафаретныеСетки;
	
	Если НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Лико_ДополнительныеПраваНачальникаФормногоУчастка")) Тогда
		Если Объект.Проведен Тогда
			Если Объект.Дата < ТекущаяДата() - 86400 Тогда
				ТолькоПросмотр = Истина;
			КонецЕсли;
			Элементы.ТабельныйНомер.ТолькоПросмотр = Истина;
		КонецЕсли;
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Элементы.Сотрудник.Доступность = Ложь;
		Элементы.ОстаткиПоЗатратам.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	Если ПредыдущийТипДокумента <> Объект.ТипДокумента И ПроверитьНеобходимостьЗадаватьВопрос() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтветНаВопросОНеобходимостиИзмененияТипаДокумента", ЭтотОбъект), "По предыдущему типу документа (" + ПредыдущийТипДокумента + ") уже есть введенные данные. При изменении они будут очищены." + Символы.ПС + "Вы уверены, что хотите изменить тип документа?", РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ПредыдущийТипДокумента = Объект.ТипДокумента;
		УстановитьВидимостьДоступностьЭлементов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТабельныйНомерПриИзмененииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Объект.Сотрудник = Неопределено;
	Если НЕ ЗначениеЗаполнено(ТабельныйНомер) Тогда
		Возврат;
	КонецЕсли;
	Объект.Сотрудник = Лико_Дополнительно.ОпределитьСотрудникаПоТабНомеру(ТабельныйНомер);
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ТабельныйНомер = Формат(Число(Прав(Объект.Сотрудник.Код, 10)), "ЧГ=0");
		//УстановитьПривилегированныйРежим(Истина);
		Объект.Организация = Объект.Сотрудник.ГоловнаяОрганизация;
		//УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТабельныйНомерПриИзменении(Элемент)
	
	ТабельныйНомерПриИзмененииНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьЗадаватьВопрос()
	
	Если (ПредыдущийТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.Формы И Объект.ИзготовлениеФорм.Количество() > 0)
		ИЛИ (ПредыдущийТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.ЗасветкиStork И Объект.ЗасветкаStork.Количество() > 0)
		ИЛИ (ПредыдущийТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.ТрафаретныеСетки И Объект.ТрафСетки.Количество() > 0) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОтветНаВопросОНеобходимостиИзмененияТипаДокумента(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если ПредыдущийТипДокумента = Объект.ТипДокумента Тогда
			Возврат;
		Иначе
			// Чистим ТЧ
			ПочиститьТЧВЗависимостиОтТипа();
		КонецЕсли;
	Иначе
		// Возвращаем тип
		Объект.ТипДокумента = ПредыдущийТипДокумента;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПочиститьТЧВЗависимостиОтТипа()
	
	Если ПредыдущийТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.Формы Тогда
		Объект.ИзготовлениеФорм.Очистить();
	ИначеЕсли ПредыдущийТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.ЗасветкиStork Тогда
		Объект.ЗасветкаStork.Очистить();
	ИначеЕсли ПредыдущийТипДокумента = Перечисления.Лико_ТипыДокументовОтчетФормногоУчастка.ТрафаретныеСетки Тогда
		Объект.ТрафСетки.Очистить();
	КонецЕсли;
	ПредыдущийТипДокумента = Объект.ТипДокумента;
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

//&НаСервере
//Функция ПроверитьВозможностьВыбораЗаказа(Заказ)
//	
//	Если Заказ.Состояние = Перечисления.Лико_СостоянияЗаказов.Закрыт Тогда
//		Возврат Ложь;
//	Иначе
//		Возврат Истина;
//	КонецЕсли;

//КонецФункции

//&НаКлиенте
//Процедура ТаблицаЗаказОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	
//	Если НЕ ПроверитьВозможностьВыбораЗаказа(ВыбранноеЗначение) Тогда
//		Сообщить("Данный заказ уже закрыт, его нельзя выбрать");
//		СтандартнаяОбработка = Ложь;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ТабельныйНомер = Число(Прав(Объект.Сотрудник.Код, 10));
	Иначе
		ТабельныйНомер = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//Начало изменений Иванова Анна 20181106 
&НаСервере
Процедура  ЗаполнитьПрокатРабочийЦентрНаСервере(ИмяТЧ, Идентификатор, НомерПроката= Неопределено, РабочийЦентр= Неопределено)
	УстановитьПривилегированныйРежим(Истина);
	текстр = Объект[ИмяТЧ].НайтиПоИдентификатору(Идентификатор);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", текстр.Заказ);
	Если ЗначениеЗаполнено(НомерПроката) ТОгда 		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр,
		|	ЗаказКлиентаВидыРабот.Ссылка КАК Заказ
		|ИЗ
		|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
		|ГДЕ
		|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
		|	И ЗаказКлиентаВидыРабот.НомерПроката = &НомерПроката";
		Запрос.УстановитьПараметр("НомерПроката", НомерПроката);
		Результат = Запрос.Выполнить().Выбрать();
		Результат.Следующий();
		текстр.рабочийцентр = Результат.РабочийЦентр;
	ИначеЕсли ЗначениеЗаполнено(Рабочийцентр) ТОгда  
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаВидыРабот.Ссылка КАК Заказ,
		|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.НомерПроката, 0) КАК НомерПроката
		|ИЗ
		|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
		|ГДЕ
		|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
		|	И ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра = &ВидРЦ";
		Запрос.УстановитьПараметр("ВидРЦ", РабочийЦентр.ВидРабочегоЦентра);
		Результат = Запрос.Выполнить().Выбрать();
		Результат.Следующий();
		текстр.номерпроката = результат.номерпроката;
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаЦвета.Ссылка КАК Заказ,
		|	ЗаказКлиентаЦвета.НомерПроката КАК НомерПроката
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
		|ГДЕ
		|	ЗаказКлиентаЦвета.Ссылка = &Заказ
		|	И ВЫБОР
		|			КОГДА &ТипДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыДокументовОтчетФормногоУчастка.Формы)
		|				ТОГДА ЗаказКлиентаЦвета.ВидПечати = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыПечати.Флексо)
		|						ИЛИ ЗаказКлиентаЦвета.ВидПечати = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыПечати.Офсет)
		|			ИНАЧЕ ЗаказКлиентаЦвета.ВидПечати = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыПечати.Траф)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаЦвета.НомерПроката,
		|	ЗаказКлиентаЦвета.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентаВидыРабот.Ссылка КАК Заказ,
		|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр,
		|	ВТ.НомерПроката КАК НомерПроката
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
		|		ПО ВТ.Заказ = ЗаказКлиентаВидыРабот.Ссылка
		|			И ВТ.НомерПроката = ЗаказКлиентаВидыРабот.НомерПроката
		|ГДЕ
		|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаВидыРабот.Ссылка,
		|	ВТ.НомерПроката,
		|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка))";
		Запрос.УстановитьПараметр("ТипДокумента", Объект.ТипДокумента);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Количество() = 1 Тогда 
			Результат.Следующий();
			текстр.рабочийцентр = Результат.РабочийЦентр;
			текстр.номерпроката = Результат.НомерПроката;
		КонецЕсли;

	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура НомерПрокатаПриИзменении(Элемент)
	ИмяТЧ = Элемент.Родитель.Имя;
	текстр = Элементы[ИмяТЧ].ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.НомерПроката) И ЗначениеЗаполнено(текстр.Заказ) Тогда 	
		//Если Не ЗначениеЗаполнено(стр.РабочийЦентр) ТОгда 
			Идентификатор = текстр.ПолучитьИдентификатор();
			ЗаполнитьПрокатРабочийЦентрНаСервере(ИмяТЧ, Идентификатор, текстр.НомерПроката);
		//КонецЕсли;			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РабочийЦентрПриИзменении(Элемент)
	ИмяТЧ = Элемент.Родитель.Имя;
	текстр = Элементы[ИмяТЧ].ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.РабочийЦентр) И ЗначениеЗаполнено(текстр.Заказ) Тогда 	
		Если Не ЗначениеЗаполнено(текстр.НомерПроката) ТОгда 
			Идентификатор = текстр.ПолучитьИдентификатор();
			ЗаполнитьПрокатРабочийЦентрНаСервере(ИмяТЧ, Идентификатор, ,текстр.рабочийЦентр);
		КонецЕсли;			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	ИмяТЧ = Элемент.Родитель.Имя;
	текстр = Элементы[ИмяТЧ].ТекущиеДанные;
	Если ЗначениеЗаполнено(текстр.Заказ) Тогда 
		Идентификатор = текстр.ПолучитьИдентификатор();
		ЗаполнитьПрокатРабочийЦентрНаСервере(ИмяТЧ, Идентификатор,);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзготовлениеФормШиринаПриИзменении(Элемент)
	текстр = Элементы.ИзготовлениеФорм.ТекущиеДанные;
	текстр.площадь = текстр.ширина*текстр.длина;
КонецПроцедуры

&НаКлиенте
Процедура ИзготовлениеФормДлинаПриИзменении(Элемент)
	текстр = Элементы.ИзготовлениеФорм.ТекущиеДанные;
	текстр.площадь = текстр.ширина*текстр.длина;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.ВидПечати) Тогда 
		Сообщить("Необходимо указать вид форм: офсет или флексо");
		Отказ = Истина;
	КонецЕсли;
	Отказ = ПроверитьПлощадьКлишеНаСервере()
КонецПроцедуры

&НаСервере
Функция ПроверитьПлощадьКлишеНаСервере()
	Если Объект.ВидПечати = Справочники.Лико_ВидыПечати.Флексо Тогда
		Для Каждого Стр из Объект.ИзготовлениеФорм Цикл
			Если Не ЗначениеЗаполнено(стр.Заказ) Тогда 
				Сообщить("Необходимо указать заказ в строке "+стр.номерстроки);
				Возврат Истина;
			Иначе
				Если Не ЗначениеЗаполнено(стр.Заказ.ПлощадьКлише) Тогда 
				    Сообщить("Не указана площадь клише "+стр.номерстроки);
					Возврат Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
						

//КонецИзменений Иванова Анна 20181106
